Term4/metopt/lectures/4.org
#+LATEX_CLASS: general
#+TITLE: Лекция 4
#+AUTHOR: Ilya Yaroshevskiy

\[ \frac{l_\text{з.с}^i}{l_\text{дих.}^i} \approx (0.87\dots)^n \] \[
\frac{l_\text{з.с}^i}{l_\text{фиб.}^i} \approx 1.17 \]

* Одномерная оптимизация
** Определение интервала неопределенности
$x_0$
1. Если $f(x_0) > f(x_0 + \delta)$, то:
   - $k = 1$
   - $x_1 = x_0 + \delta$
   - $h = \delta$
   иначе если $f(x_0) > f(x_0) - \delta$, то:
   - $x_1 = x_0 - \delta$
   - $h = -\delta$
2. Удваиваем $h$:
   - $h = 2h$
   - $x_{k + 1} = x_k + h$
3. Если $f(x_k) > f(x_{k + 1})$, то:
   - $k = k + 1$
   - переходим к шагу 2
   Иначе:
   - прекращаем поиск $[x_{k - 1}, x_{k + 1}]$
* Методы с использованием производной

- $f(x)$ --- дифференцируемая или дважды дифференцируемая выпуклая функция
- вычисление производных в заданых точках

$f'(x) = 0$ --- необходимое и достаточное условие глобального
минимума.  Если $x^* \in [a, b]\ f'(x) \approx 0$ или $f'(x) \le
\varepsilon$ --- условие остановки вычислений
** Метод средней точки
$f'(x)\quad \bar{x} = \frac{a + b}{2}$ \\
- Если $f'(\bar{x}) > 0$, то $\bar{x}\in$ монотонно возрастающая
  $f(x)$, минимум на $[a, \bar{x}]$
- Если $f'(x) < 0$ минимум на $[\bar{x}, b]$
- Если $f'(x) = 0$ то $x^* = x$

*Алгоритм*
1. $\bar{x} = \frac{a + b}{2}$, вычислим $f'(\bar{x})$ \rightarrow шаг
   2
2. Если $|f'(x)| \le \varepsilon$, то $x^* = \bar{x}$ и $f(x^*) =
   f(\bar{x})$ \rightarrow завершить
3. Сравнить $f'(\bar{x})$ с нулем:
   - Если $f'(x) > 0$, то $[a, \bar{x}], b = \bar{x}$
   - Иначе $[\bar{x}, b], a=\bar{x}$
   \rightarrow шаг 1
\[ \Delta_n = \frac{b - a}{2^n} \]
** Метод хорд(метод секущей)
Если на концах $[a, b]$ $f'(x)$: $f'(a)\cdot f'(b) < 0$ и непрерывна,
то на $(a, b)$ $\exists x\ f'(x) = 0$ \\
$f(x)$ --- минимум на $[a, b]$, если $f'(x) = 0$, $x\in(a, b)$ \\
$F(x) = f'(x) = 0$ на $[a, b]$ \\
$F(a)\cdot F(b) < 0$, $\bar{x}$ --- точка пересечения $F(x)$ с осью $Ox$ на $[a, b]$
\[ \bar{x} = a - \frac{f'(a)}{f'(a) - f'(b)}(a - b) \label{hord_1_4}\addtag\]
$x^* \in [a, \tilde{x}]$ либо $[\tilde{x}, b]$

*Алгоритм*
1. $\tilde{x}$ --- вычислим по \ref{hord_1_4} \\
   вычислим $f'(\tilde{x})$ \to шаг 2
2. Если $|f'(\tilde{x})|\le\varepsilon$, то:
   - $x^* = \tilde{x}$
   - $f^* = f(\tilde{x})$
   - завершить
   Иначе:
   - \to шаг 3
3. Переход к новому отрезку. Если $f'(\tilde{x}) > 0$, то:
   - $[a, \tilde{x}]$
   - $b = \tilde{x}$
   - $f'(b) = f'(\tilde{x})$
   Иначе:
   - $[\tilde{x}, b]$
   - $a = \tilde{x}$
   - $f'(a) = f'(\tilde{x})$
   \to шаг 1
*Исключение*.
1. $f'(a)\cdot f'(b) > 0$, $f(x)$ --- возрастает
   - $x^* = a$
   - $x^* = b$
2. $f'(a)\cdot f'(b)$, *одно из*:
   - $x^* = a$
   - $x^* = b$
** Метод Ньютона(метод касательной)
Если выпуклая на $[a, b]$ функция $f(x)$ --- дважды непрерывно
дифференцируема, то $x^* \in [a, b]:\ f'(x) = 0$ \\
Пусть $x_0 \in [a, b]$ --- начальное приближение к $x^*$
\[ F(x) = f'(x)\text{ --- линеаризуем в корестнтсти } x_0 \]
(x_0, f'(x_0)), то есть:
\[ F(x) \approx F(x_0) + F'(x_0)(x - x_0) \]
$x_1$ ---
- следующее приближение к $x^*$
- пересечение касательной с $Ox$

При $x = x_1$:
\[ F(x_0) + F'(x_0)(x_1 - x_0) = 0 \]
\[ x_1 = x_0 = \frac{F(x_0)}{F'(x_0)} \]
$\{x_k\},\ k = 1, 2, \dots$ --- итерационная последовательность \\
$F(x)$ в точке $x = x_k$ имеет вид:
\[ y = F(x_k) + F'(x_k)(x - x_k) \]
$x = x_{k + 1}\ y = 0$:
\[ x_{k+1} = x_k - \frac{F(x_k)}{F'(x_k)} \]
\[ f'(x) = 0 \Rightarrpw x_{k + 1} = x_k - \frac{f'(x_k)}{f''(x_k)}\quad,k=1,2,\dots \]
Итерационный процесс: $|f'(x_k)| \le \varepsilon$:
- $x^* \approx x$
- $x^* \approx f(x_k)$

