Term4/metopt/lectures/4.tex
% Created 2021-02-27 Sat 19:34
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{Лекция 4}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={Лекция 4},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\[ \frac{l_\text{з.с}^i}{l_\text{дих.}^i} \approx (0.87\dots)^n \] \[
\frac{l_\text{з.с}^i}{l_\text{фиб.}^i} \approx 1.17 \]

\section{Одномерная оптимизация}
\label{sec:orgda7c496}
\subsection{Определение интервала неопределенности}
\label{sec:org70de6d7}
\(x_0\)
\begin{enumerate}
\item Если \(f(x_0) > f(x_0 + \delta)\), то:
\begin{itemize}
\item \(k = 1\)
\item \(x_1 = x_0 + \delta\)
\item \(h = \delta\)
\end{itemize}
иначе если \(f(x_0) > f(x_0) - \delta\), то:
\begin{itemize}
\item \(x_1 = x_0 - \delta\)
\item \(h = -\delta\)
\end{itemize}
\item Удваиваем \(h\):
\begin{itemize}
\item \(h = 2h\)
\item \(x_{k + 1} = x_k + h\)
\end{itemize}
\item Если \(f(x_k) > f(x_{k + 1})\), то:
\begin{itemize}
\item \(k = k + 1\)
\item переходим к шагу 2
\end{itemize}
Иначе:
\begin{itemize}
\item прекращаем поиск \([x_{k - 1}, x_{k + 1}]\)
\end{itemize}
\end{enumerate}
\section{Методы с использованием производной}
\label{sec:orge9a565a}

\begin{itemize}
\item \(f(x)\) --- дифференцируемая или дважды дифференцируемая выпуклая функция
\item вычисление производных в заданых точках
\end{itemize}

\(f'(x) = 0\) --- необходимое и достаточное условие глобального
минимума.  Если \(x^* \in [a, b]\ f'(x) \approx 0\) или \(f'(x) \le
\varepsilon\) --- условие остановки вычислений
\subsection{Метод средней точки}
\label{sec:orga5d4341}
\(f'(x)\quad \bar{x} = \frac{a + b}{2}\) \\
\begin{itemize}
\item Если \(f'(\bar{x}) > 0\), то \(\bar{x}\in\) монотонно возрастающая
\(f(x)\), минимум на \([a, \bar{x}]\)
\item Если \(f'(x) < 0\) минимум на \([\bar{x}, b]\)
\item Если \(f'(x) = 0\) то \(x^* = x\)
\end{itemize}

\textbf{Алгоритм}
\begin{enumerate}
\item \(\bar{x} = \frac{a + b}{2}\), вычислим \(f'(\bar{x})\) \(\rightarrow\) шаг
2
\item Если \(|f'(x)| \le \varepsilon\), то \(x^* = \bar{x}\) и \(f(x^*) =
   f(\bar{x})\) \(\rightarrow\) завершить
\item Сравнить \(f'(\bar{x})\) с нулем:
\begin{itemize}
\item Если \(f'(x) > 0\), то \([a, \bar{x}], b = \bar{x}\)
\item Иначе \([\bar{x}, b], a=\bar{x}\)
\end{itemize}
\(\rightarrow\) шаг 1
\end{enumerate}
\[ \Delta_n = \frac{b - a}{2^n} \]
\subsection{Метод хорд(метод секущей)}
\label{sec:org75e388a}
Если на концах \([a, b]\) \(f'(x)\): \(f'(a)\cdot f'(b) < 0\) и непрерывна,
то на \((a, b)\) \(\exists x\ f'(x) = 0\) \\
\(f(x)\) --- минимум на \([a, b]\), если \(f'(x) = 0\), \(x\in(a, b)\) \\
\(F(x) = f'(x) = 0\) на \([a, b]\) \\
\(F(a)\cdot F(b) < 0\), \(\bar{x}\) --- точка пересечения \(F(x)\) с осью \(Ox\) на \([a, b]\)
\[ \bar{x} = a - \frac{f'(a)}{f'(a) - f'(b)}(a - b) \label{hord_1_4}\addtag\]
\(x^* \in [a, \tilde{x}]\) либо \([\tilde{x}, b]\)

\textbf{Алгоритм}
\begin{enumerate}
\item \(\tilde{x}\) --- вычислим по \ref{hord_1_4} \\
вычислим \(f'(\tilde{x})\) \(\to\) шаг 2
\item Если \(|f'(\tilde{x})|\le\varepsilon\), то:
\begin{itemize}
\item \(x^* = \tilde{x}\)
\item \(f^* = f(\tilde{x})\)
\item завершить
\end{itemize}
Иначе:
\begin{itemize}
\item \(\to\) шаг 3
\end{itemize}
\item Переход к новому отрезку. Если \(f'(\tilde{x}) > 0\), то:
\begin{itemize}
\item \([a, \tilde{x}]\)
\item \(b = \tilde{x}\)
\item \(f'(b) = f'(\tilde{x})\)
\end{itemize}
Иначе:
\begin{itemize}
\item \([\tilde{x}, b]\)
\item \(a = \tilde{x}\)
\item \(f'(a) = f'(\tilde{x})\)
\end{itemize}
\(\to\) шаг 1
\end{enumerate}
\textbf{Исключение}.
\begin{enumerate}
\item \(f'(a)\cdot f'(b) > 0\), \(f(x)\) --- возрастает
\begin{itemize}
\item \(x^* = a\)
\item \(x^* = b\)
\end{itemize}
\item \(f'(a)\cdot f'(b)\), \textbf{одно из}:
\begin{itemize}
\item \(x^* = a\)
\item \(x^* = b\)
\end{itemize}
\end{enumerate}
\subsection{Метод Ньютона(метод касательной)}
\label{sec:org3907d65}
Если выпуклая на \([a, b]\) функция \(f(x)\) --- дважды непрерывно
дифференцируема, то \(x^* \in [a, b]:\ f'(x) = 0\) \\
Пусть \(x_0 \in [a, b]\) --- начальное приближение к \(x^*\)
\[ F(x) = f'(x)\text{ --- линеаризуем в корестнтсти } x_0 \]
(x\textsubscript{0}, f'(x\textsubscript{0})), то есть:
\[ F(x) \approx F(x_0) + F'(x_0)(x - x_0) \]
\(x_1\) ---
\begin{itemize}
\item следующее приближение к \(x^*\)
\item пересечение касательной с \(Ox\)
\end{itemize}

При \(x = x_1\):
\[ F(x_0) + F'(x_0)(x_1 - x_0) = 0 \]
\[ x_1 = x_0 = \frac{F(x_0)}{F'(x_0)} \]
\(\{x_k\},\ k = 1, 2, \dots\) --- итерационная последовательность \\
\(F(x)\) в точке \(x = x_k\) имеет вид:
\[ y = F(x_k) + F'(x_k)(x - x_k) \]
\(x = x_{k + 1}\ y = 0\):
\[ x_{k+1} = x_k - \frac{F(x_k)}{F'(x_k)} \]
\[ f'(x) = 0 \Rightarrpw x_{k + 1} = x_k - \frac{f'(x_k)}{f''(x_k)}\quad,k=1,2,\dots \]
Итерационный процесс: \(|f'(x_k)| \le \varepsilon\):
\begin{itemize}
\item \(x^* \approx x\)
\item \(x^* \approx f(x_k)\)
\end{itemize}
\end{document}
